[
    {
        "id": "wbac",
        "date": "Apr 2017 - Present",
        "employer": "WeBuyAnyCar.com Ltd",
        "position": "Software Developer",
        "overview": "Hired for my expertise in mobile development, I helped the company migrate their public facing mobile app from a Cordova based product to Xamarin Forms. I was responsible for architecting the app’s structure and providing the team and stakeholders with valuable insight surrounding mobile design best practice.",
        "details": "Hired for my expertise in mobile development, I helped the company migrate their public facing mobile app from a Cordova based product to Xamarin Forms. I was responsible for architecting the app’s structure and providing the team and stakeholders with valuable insight into mobile design best practice.<br/><br/>Following on from the conclusion of this project, my work has focused on redevelopment of the comapny's public facing website and its accompanying back end systems. Moving the website to an Angular front-end for increased speed and completelty overhauling the UI.",
        "skills": [
            "Xamarin Forms 3.5",
            "Azure Devops",
            "Octopus Deploy",
            "VS App Center & TestFlight",
            "Apple & Google App Stores",
            "Xamarin UI Test",
            "VSTS Extensions",
            "ASP.NET Core",
            "UWP",
            "Typescript",
            "Angular",
            "Sass",
            "Jasmine",
            "Google Tag Manager"
        ]
    },
    {
        "id": "dcl",
        "date": "Jan 2017 - Apr 2017",
        "employer": "Democracy Counts Ltd",
        "position": "Mobile Developer",
        "overview": "Brought into the company as their only mobile developer, it was my responsibility to design and build a proof-of-concept application designed for electors to manage their registrations on the Electoral Roll.",
        "details": "Brought into the company as their only mobile developer, it was my responsibility to design and build a proof-of-concept application designed for electors to manage their registrations on the Electoral Roll. I was under a little pressure from the start, as a rough version of the app was required within 6 weeks of starting for demonstration at an annual tradeshow. <br/><br/> Building the application in Xamarin Android with a Portable Class Library (PCL) allowed me to quickly iterate and provide a working demo with push notifications in time for the opening day.\r\n\r\nUsing a PCL with MVVM architecture allowed us to quickly build out the iOS version of the application too, as only the UI needed to be implemented.<br/><br/>Despite being provided full automony over the product, the role was 100% remote, with the other members of the team on the other side of the country. I found the isolation to be too much and decided, a role which was a little more office based was more suited to me.",
        "skills": [
            "Xamarin Native",
            "Mvvm Light",
            "Azure Push Notifications"
        ]
    },
    {
        "id": "sainsburys",
        "date": "Jun 2015 - Jan 2017",
        "employer": "Sainsbury\"s Supermarkets Ltd",
        "position": "Software Engineer",
        "overview": "As a member of the SmartShop project I was part of a team developing Windows and Xamarin (Forms & Native) apps to provide support functions for their new in-store Scan & Go service. As well as building apps, the role included providing support to the other mobile app devs, pair programming to fix bugs and helping build features on both the native iOS and Android apps; working on site (in stores) deploying hardware and software; and assisting customers with the initial on-boarding process.",
        "details": "As a member of the SmartShop project I was part of a team developing Windows and Xamarin (Forms & Native) apps to provide support functions for their new in-store Scan & Go service. As well as building apps, the role included providing support to the other mobile app devs, pair programming to fix bugs and helping build features on both the native iOS and Android apps; working on site (in stores) deploying hardware and software; and assisting customers with the initial on-boarding process.<br/><br/>Alongside the SmartShop project, I was also required to help maintain the Sainsbury’s Entertainment eBooks and Video On-Demand (VoD) Windows 8.1 UAP apps.",
        "skills": [
            "Xamarin Forms 2.1",
            "Windows 10 UWP",
            "Windows/Phone 8.1 UAP",
            "Git version control",
            "UX & Accessibility best practice",
            "Handset interop with Zebra EMDK",
            "Windows Service Applications",
            "MQTT messaging",
            "Omniture Analytics"
        ]
    },
    {
        "id": "verco",
        "date": "Jul 2013 - Jun 2015",
        "employer": "Verco Advisory Services Ltd",
        "position": "Junior Developer",
        "overview": "Worked on a number of bespoke ASP MVC 5 projects working in both small and medium teams to deliver the software.",
        "details": "Worked on a number of bespoke ASP MVC 5 projects working in both small and medium teams to deliver the software. As an advocate of Modern Design principles, I was frequently tasked with designing assets and providing UX guidance to the rest of the team, as well as ensuring that layouts were device friendly. Worked with the full .Net web stack, building entire slices of functionality from SQL, to JavaScript, refactoring legacy code where appropriate, and building brand new functionality into the product.",
        "skills": [
            "Windows Phone 7/8 Silverlight",
            "ASP.NET MVC5",
            "KnockoutJS",
            "jQuery",
            "MSSQL"
        ]
    },
    {
        "id": "cpw",
        "date": "Jan 2012 - Jul 2013",
        "employer": "Carphone Warehouse PLC",
        "position": "Customer Service Representative",
        "overview": "Provided support to customers on a wide range of queries. Part of the role also required providing support to the Retail Divisions when required. Alongside this I trained & coached staff, providing support for the management team.",
        "details": "Provided support to customers on a wide range of queries. Part of the role also required providing support to the Retail Divisions when required. Alongside this I trained & coached staff, providing support for the management team.",
        "isOmittedInPrint": true,
        "skills": [
            "Complaint handling",
            "Logistics organisation",
            "Peer-to-peer training"
        ]
    },
    {
        "id": "bby",
        "date": "Nov 2010 - Jan 2012",
        "employer": "Best Buy UK",
        "position": "Customer Service Advisor",
        "overview": "As a customer service agent, I was required to provide accurate, up-to-date advice and help on the full range of products, to ensure customer satisfaction. During my time I had to additional duties including Process development, supervision of staff, and building a number of WPF programs to assist all contact centre advisors, including everyday utilities and training development tools.",
        "details": "As a customer service agent, I was required to provide accurate, up-to-date advice and help on the full range of products, to ensure customer satisfaction. During my time I had to additional duties including Process development, supervision of staff, and building a number of WPF programs to assist all contact centre advisors, including everyday utilities and training development tools.",
        "isOmittedInPrint": true,
        "skills": [
            "SAP",
            "High-Level reporting"
        ]
    },
    {
        "id": "morrisons",
        "date": "Jun 2003 - Nov 2010",
        "employer": "Wm Morrisons PLC",
        "position": "Customer Cafe Manager",
        "overview": "Responsibilities included: Arranging rotas for 20 staff, updating purchasing accounts, recording and ordering stock and expenses, ensuring staff had the guidance they need to develop, carrying out annual appraisals and weekly training updates.",
        "details": "Initially working part-time to bolster my income while a student, I demonstrated my ability to lead and was promoted from Supervisor while still at university and was promoted further to Manger post-graduation.\r\n\r\nI had to ensure that the Café ran smoothly at all times and that all legal requirements were adhered to. Responsibilities included: Arranging rotas for 20 staff, updating purchasing accounts, recording and ordering stock and expenses, ensuring staff had the guidance they need to develop, carrying out annual appraisals and weekly training updates.",
        "isOmittedInPrint": true,
        "skills": [
            "Leadership skills",
            "Staff management",
            "Team organisation"
        ]
    },
    {
        "id": "multimedia",
        "date": "Jun 2002 - Nov 2002",
        "employer": "Multimedia Shop",
        "position": "Computer Technician",
        "overview": "I worked in a computer repair and supply shop, building bespoke PCs for customers of varying technical ability and providing support and training to those who needed it.",
        "details": "I worked in a computer repair and supply shop, building bespoke PCs for customers of varying technical ability and providing support and training to those who needed it.",
        "isOmittedInPrint": true,
        "skills": []
    },
    {
        "id": "bt",
        "date": "Nov 2001",
        "employer": "British Telecoms",
        "position": "System Programming Assistant",
        "overview": "Work experience placement. Helped in facilitating the location and correction of errors in the BT Broadband help desk software using Delphi.",
        "details": "Work experience placement. Helped in facilitating the location and correction of errors in the BT Broadband help desk software using Delphi.",
        "isOmittedInPrint": true,
        "skills": []
    }
]